Revit 2027 API
ScheduleSortGroupField.SortOrder Property
 Indicates if elements in the schedule will be sorted in ascending or descending order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleSortOrder SortOrder { get; set; }
Public Property SortOrder As ScheduleSortOrder
	Get
	Set
public:
property ScheduleSortOrder SortOrder {
	ScheduleSortOrder get ();
	void set (ScheduleSortOrder value);
}
member SortOrder : ScheduleSortOrder with get, set
Property Value
ScheduleSortOrder
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace